{
  "backend/main.mo": "Main ICP actor implementing user profile management and conversation session CRUD with role-based access control, supporting operations like saving/retrieving profiles and sessions with owner/admin authorization checks.",
  "backend/migration.mo": "Data migration module that transforms old conversation session records (with emotions, intents, toxicity flags) into the new ExtendedConversationSession format (with patterns, biasLog, ethicalViolations), assigning legacy sessions to the anonymous principal.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (pattern prediction engine, bias detection extension, hallucination guardrail) to their associated source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Auto-generated documentation file containing one- to two-sentence summaries of each frontend source file, describing component responsibilities and notable implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, covering colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the React root div and loading the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that gates rendering on Internet Identity authentication state, showing a login landing page, profile setup modal, or the main Dashboard, with a global Toaster for notifications.",
  "frontend/src/components/AppHeader.tsx": "Application header component displaying the Olya logo, version badge, system status indicators (ASR/NLP/Ethics), the authenticated user's profile name, and the login/logout button.",
  "frontend/src/components/BeliefStatePanel.tsx": "Renders a canvas-based belief state visualization showing a central trust node and orbiting speaker nodes connected by dashed lines, with node sizes and colors reflecting speaker roles and message counts.",
  "frontend/src/components/EmotionIntentPanel.tsx": "Displays emotion and intent analysis for the latest transcript entry, showing confidence progress bars for each detected emotion and intent, plus a history of recent entries grouped by speaker.",
  "frontend/src/components/EthicsBadge.tsx": "A compact or expandable badge component that displays ethics analysis results (Clean, Bias, Toxic, or violation type) with icons, severity, flags, and bias category details.",
  "frontend/src/components/LanguageSelector.tsx": "A searchable popover dropdown for selecting a transcript language, supporting auto-detect and a full list of languages with native name and code display.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/PanelContainer.tsx": "A reusable styled panel wrapper with a header (title, icon, status dot, optional right content) and support for active glow variants in default or amber color schemes.",
  "frontend/src/components/PatternPredictionsPanel.tsx": "Displays predicted conversation patterns (escalating, de-escalating, stable) with confidence bars, urgency indicators, hallucination guard warnings, and ethical constraint enforcement on prediction content.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their operator name and saves the profile via the `useSaveCallerUserProfile` mutation hook. The dialog is non-dismissible and blocks interaction until a name is submitted.",
  "frontend/src/components/SafetyQualityPanel.tsx": "Displays AI safety and quality metrics including bias count, hallucination flag rate, ethical violation count, and a circular trustworthiness gauge with color-coded thresholds.",
  "frontend/src/components/SemanticAnalysisPanel.tsx": "Renders NLP analysis of transcript entries, aggregating and displaying emotion counts, intent counts, toxicity flags, and per-entry details using color-coded badges in a scrollable panel.",
  "frontend/src/components/SessionManager.tsx": "A sidebar panel that lists conversation sessions ordered by timestamp, allowing users to create new sessions, select existing ones, or delete them, with health status indicators per session.",
  "frontend/src/components/SessionSummaryBar.tsx": "A top summary bar showing key session metrics—health score gauge, exchange count, dominant emotion, top strategy, and bias incidents—with color-coded indicators and an optional read-only badge.",
  "frontend/src/components/StrategyEnginePanel.tsx": "Displays AI-generated negotiation strategy recommendations with confidence scores, running each through ethical constraint and hallucination guard checks before rendering, and persisting used strategies to the backend.",
  "frontend/src/components/TranscriptInput.tsx": "A React component providing a transcript entry form with a textarea, speaker role selector, language selector, and speech recognition toggle for submitting labeled transcript lines.",
  "frontend/src/components/TranscriptPanel.tsx": "A React component that renders a scrollable list of transcript entries, displaying speaker badges, timestamps, emotion/toxicity analysis badges, and ethics violation highlights.",
  "frontend/src/data/languages.ts": "Exports a typed LANGUAGES array containing language objects with BCP-47 codes, English names, and native names for a large set of world languages and regional variants.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing it when the Internet Identity changes.",
  "frontend/src/hooks/useDashboardState.ts": "Defines dashboard state types and provides a hook managing transcript entries with simulated NLP analysis (emotion, intent, toxicity detection) and belief-state tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useLanguagePreference.ts": "A hook that persists and retrieves the user's preferred transcription language code in localStorage, defaulting to 'auto'.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on user profiles, conversation sessions, and pattern profiles, using a backend actor obtained via useActor or the query cache.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook wrapping the Web Speech API to provide start/stop/toggle controls, interim and final transcript callbacks, error handling, and optional language detection.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines OKLCH-based CSS custom properties for light/dark themes along with reusable component utility classes.",
  "frontend/src/lib/utils.ts": "Exports a single cn utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that orchestrates transcript input, session management, and multiple analysis panels (emotion, belief state, patterns, safety) with create/update/delete session mutations and ethics/hallucination checks.",
  "frontend/src/utils/beliefStateSimulator.ts": "Simulates a belief graph by extracting positions and interests from transcript text and building nodes/edges representing speaker stances, confidence levels, and relationships.",
  "frontend/src/utils/emotionIntentSimulator.ts": "Provides keyword-pattern-based analysis to detect dominant emotion (e.g., Frustrated, Confident) and intent (e.g., Negotiating, Demanding) from input text, returning scored results with confidence values.",
  "frontend/src/utils/ethicalConstraints.ts": "Enforces ethical text rules by detecting and redacting violations such as personal attacks, manipulative framing, dehumanizing language, and coercive pressure using regex patterns.",
  "frontend/src/utils/ethicsSimulator.ts": "Scans text for toxicity, bias, and discriminatory language (gender, racial, socioeconomic) using regex patterns, returning severity ratings, flags, and categorized bias results.",
  "frontend/src/utils/hallucinationGuard.ts": "Detects potentially hallucinated content in text by matching patterns like unsourced statistics, vague authority claims, and absolute statements that contradict prior context, returning a confidence score and suspect phrases.",
  "frontend/src/utils/nlpSimulator.ts": "Performs client-side semantic analysis on text to extract topics, named entities, sentiment, and keywords using keyword matching and regex patterns.",
  "frontend/src/utils/patternPredictionEngine.ts": "Client-side prediction engine that analyzes recent transcript entries and a pattern profile to predict next emotion, next intent, negotiation direction, and de-escalation windows using frequency-weighted heuristics.",
  "frontend/src/utils/strategySimulator.ts": "Defines a strategy recommendation matrix keyed by emotion-intent combinations and exports logic to select and return ranked negotiation strategies with confidence scores and rationale.",
  "frontend/src/utils/trustworthinessScoreCalculator.ts": "Calculates a 0–100 trustworthiness score by applying capped penalties for bias incidents, ethical violations, and hallucination flag rates.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL parameters from both query strings and hash-based routes, persisting them to sessionStorage, and removing sensitive parameters from the URL without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH color tokens (teal, amber, navy, charcoal, panel), typography/container-query/animate plugins, and custom shadows and keyframes.",
  "project_state.json": "Project state manifest describing the Olya App's architecture, versioning, and implemented features including prediction engine, bias detection, hallucination guardrails, ethical constraints, and safety scoring."
}