{
  "backend/main.mo": "Main Motoko actor implementing the backend for user profiles and conversation sessions, with role-based access control (admin/user permissions) for all CRUD operations on sessions and profiles.",
  "feature_evidence.json": "Feature evidence report linking the session-creation bug fix to the file `frontend/src/hooks/useQueries.ts` with high confidence, referencing test ID REQ-1.",
  "frontend-file-summaries.txt": "A JSON document containing one-to-two sentence summaries of every frontend source file, describing the purpose and key changes in each component, hook, and page.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the React root into `<div id='root'>` and loading `src/main.tsx` as an ES module.",
  "frontend/src/App.tsx": "Root React application component that sets up routing, React Query, theming, and authentication flow including profile setup modal, language selection screen, and automatic user-role assignment after login.",
  "frontend/src/components/AppHeader.tsx": "Sticky application header displaying the Olya logo, ASR engine and NLP/ethics status badges, a User Manual navigation button, a compact language selector, and the login button.",
  "frontend/src/components/AppLanguageSelector.tsx": "Language selector component supporting 41 languages, available in both a full-screen onboarding variant and a compact popover variant, backed by the `useAppLanguagePreference` hook.",
  "frontend/src/components/BeliefStatePanel.tsx": "Renders a canvas-based visualization of belief state including trust level, speaker orbit nodes, persuasion arc, and concerns overlay, plus a grid of summary stats below the canvas.",
  "frontend/src/components/EmotionIntentPanel.tsx": "Displays emotion and intent confidence bars for the latest transcript entry, along with a speaker badge and a scrollable list of recent entries.",
  "frontend/src/components/EthicsBadge.tsx": "Shows a compact or expandable badge indicating ethics analysis status (Clean, Bias, Toxic, or a specific violation type) with optional drill-down into flags and bias categories.",
  "frontend/src/components/LanguageSelector.tsx": "A searchable popover dropdown for selecting a transcript language, supporting an auto-detect option that displays the latest detected language code as a badge.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state and toggling between login/logout actions via the useInternetIdentity hook.",
  "frontend/src/components/PanelContainer.tsx": "A reusable styled panel wrapper with a header (title, icon, status dot, optional right-side content) and support for active glow variants (default teal or amber).",
  "frontend/src/components/PatternPredictionsPanel.tsx": "Displays pattern prediction cards (next emotion, next intent, conversation direction, risk level) derived from transcript entries using the pattern prediction engine, with a minimum entry requirement of two.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that prompts new users to enter an operator name to initialize their profile, calling an async `onSave` callback on form submission.",
  "frontend/src/components/SafetyQualityPanel.tsx": "Displays computed safety metrics (bias incidents, flag rate, ethical violations, trust score) derived from transcript entries, with color-coded values and status badges.",
  "frontend/src/components/SemanticAnalysisPanel.tsx": "Renders semantic analysis of transcript entries including aggregated emotion and intent distributions with color-coded badges, plus toxicity flag types for the latest entry.",
  "frontend/src/components/SessionManager.tsx": "A sidebar panel that lists conversation sessions with previews and timestamps, supporting session selection, creation, and deletion with loading states.",
  "frontend/src/components/SessionSummaryBar.tsx": "A compact summary bar showing key session metrics—health score, exchange count, dominant emotion, top strategy, and bias incidents—derived from transcript entries and belief state.",
  "frontend/src/components/StrategyEnginePanel.tsx": "A panel that generates and displays RL-ranked negotiation strategies from transcript entries using a simulated LLaMA+RL engine, with confidence score badges and an ethics guard notice for flagged entries.",
  "frontend/src/components/TranscriptInput.tsx": "A React component providing a transcript entry form with a textarea, speaker role selector, ASR engine selector, and microphone toggle for speech recognition input.",
  "frontend/src/components/TranscriptPanel.tsx": "A React component that renders a scrollable list of transcript entries with speaker badges, detected language indicators, toxicity flags, and per-entry translation toggles.",
  "frontend/src/data/languages.ts": "Exports a comprehensive static array of Language objects (code, name, nativeName) covering hundreds of world languages and regional variants.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using React Query, initializing it with the current Internet Identity and an optional admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAppLanguagePreference.ts": "A React hook backed by a module-level singleton that reads/writes the app UI language preference to localStorage and broadcasts changes to all mounted hook instances.",
  "frontend/src/hooks/useAsrEnginePreference.ts": "A React hook that persists and retrieves the selected ASR engine ('webSpeech', 'whisper', or 'deepspeech') in localStorage, defaulting to 'webSpeech'.",
  "frontend/src/hooks/useDashboardState.ts": "A React hook managing the core dashboard state including transcript entries, belief state (trust/persuasion scores), and NLP analysis (emotion, intent, ethics, strategies) for each added entry.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useLanguagePreference.ts": "Custom hook that reads and writes a transcription language preference to localStorage, defaulting to 'auto'.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor operations including user profile management, session CRUD, and role assignment.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech API with support for multiple ASR engine modes (webSpeech, Whisper, DeepSpeech), including simulated transcripts and processing status for non-native engines.",
  "frontend/src/hooks/useTranslation.ts": "Custom hook that returns a translation function `t` based on the current app language preference, with fallback to English.",
  "frontend/src/i18n/translations.ts": "Contains a large translation dictionary mapping UI string keys to translations across 41 supported languages, with a `getTranslation` helper that falls back to English.",
  "frontend/src/index.css": "Global stylesheet importing fonts and Tailwind, defining CSS custom properties for light/dark themes and custom component utility classes like `panel-base` and `panel-glow`.",
  "frontend/src/lib/utils.ts": "Exports a `cn` utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that orchestrates session management, transcript input, and multiple analysis panels (emotion, belief state, safety, strategy, etc.) using React Query hooks and Internet Identity authentication.",
  "frontend/src/pages/UserManual.tsx": "A printable user manual page with structured sections, table of contents, and reusable components (Section, StepList, InfoBox, FeatureTag) covering all major app features.",
  "frontend/src/utils/beliefStateSimulator.ts": "Simulates a belief graph by extracting negotiation positions and interests from transcript text and building nodes/edges representing speaker stances, trust, and persuasion levels.",
  "frontend/src/utils/emotionIntentSimulator.ts": "Analyzes transcript text using regex pattern matching to detect emotions (anger, joy, fear, etc.) and intents (negotiating, persuading, cooperating, etc.), with optional translation to English before analysis.",
  "frontend/src/utils/ethicalConstraints.ts": "Detects and sanitizes unethical language in text by matching against rule sets for personal attacks, manipulative framing, dehumanizing language, and coercive pressure, returning a violation type and redacted text.",
  "frontend/src/utils/ethicsSimulator.ts": "Provides client-side ethics analysis by scanning text against toxicity, bias, gender, racial, and socioeconomic pattern lists, returning a structured result with status, severity, flags, and categorized bias findings.",
  "frontend/src/utils/hallucinationGuard.ts": "Detects potential hallucinations in AI-generated text by matching patterns for unsourced statistics, vague authority claims, and context contradictions, returning a confidence score and list of suspect phrases.",
  "frontend/src/utils/languageDetector.ts": "Detects the language of input text using Unicode range checks for non-Latin scripts and keyword frequency matching for Latin-script languages, returning an ISO 639-1 language code.",
  "frontend/src/utils/llamaRLEngine.ts": "Implements a reinforcement-learning-inspired engine that scores and ranks negotiation strategy candidates based on trust level, persuasion score, dominant emotion, and intent derived from a recent transcript window.",
  "frontend/src/utils/nlpSimulator.ts": "Performs client-side semantic analysis on text, extracting topics via keyword matching, named entities via regex patterns, sentiment via positive/negative word counts, and top keywords.",
  "frontend/src/utils/patternPredictionEngine.ts": "Analyzes transcript entries to predict next emotion/intent, assess conversation direction (escalating/de-escalating/stable), generate action window recommendations, and estimate hallucination risk with a confidence score.",
  "frontend/src/utils/strategySimulator.ts": "Wraps the LLaMA+RL engine to generate negotiation strategy recommendations from either raw text/intents or a list of transcript entries, with fallback strategies on error.",
  "frontend/src/utils/translationSimulator.ts": "Provides client-side phrase-by-phrase translation simulation using a hardcoded multilingual dictionary covering common negotiation and conversation terms across multiple languages.",
  "frontend/src/utils/trustworthinessScoreCalculator.ts": "Calculates a 0–100 trustworthiness score by applying capped penalties for bias incidents, ethical violations, and hallucination flag rates.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters from both query strings and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-mode design system with custom OKLCH color tokens (teal, amber, navy, charcoal, panel), custom fonts, box shadows, and animation keyframes, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking the current fix request: investigating and resolving a bug that prevents new conversation sessions from being created, with pointers to the backend createSession call, useQueries.ts mutation, and Dashboard.tsx handler."
}